{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/3cf46cb9-99d5-42ee-a43c-7bd88ea394a1')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/3cf46cb9-99d5-42ee-a43c-7bd88ea394a1')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "triggerThreshold": 0,
        "eventGroupingSettings": {
          "aggregationKind": "AlertPerResult"
        },
        "triggerOperator": "gt",
        "query": "CommonSecurityLog\n| where DeviceProduct == \"IronDefense\"\n| summarize arg_max(TimeGenerated, *) by DeviceCustomString4, DeviceCustomString2\n| extend Category = coalesce(column_ifexists(\"DeviceEventCategory\",\"\"),extract(@'cat=([^;]+)(\\;|$)', 1, AdditionalExtensions))\t\n| extend Subcategory = extract(@'subcat=([^;]+)(\\;|$)', 1, AdditionalExtensions)\n| extend AlertDescription = strcat(Category, ': ', Subcategory)\n| extend Status = tostring(DeviceCustomString2)\n| extend IronVueUrl = replace(@'\\\\', @'', tostring(DeviceCustomString3))\n",
        "tactics": null,
        "queryFrequency": "5m",
        "alertDetailsOverride": {
          "alertDisplayNameFormat": "{{Category}}: {{Subcategory}} ({{DeviceCustomString4}})\n",
          "alertSeverityColumnName": "LogSeverity",
          "alertDescriptionFormat": "IronDefense detected suspicious activity on {{TimeGenerated}} and categorized it as \"{{AlertDescription}}\".  View full details in IronVue: {{IronVueUrl}}\n"
        },
        "description": "'Creates incidents based on behavioral detections from IronDefense.'\n",
        "queryPeriod": "5m",
        "customDetails": {
          "AnalystSeverity": "DeviceCustomString1",
          "AnalystRating": "LogSeverity",
          "IronDefenseStatus": "Status",
          "AlertCreatedTime": "TimeGenerated",
          "IronVueUrl": "IronVueUrl",
          "IronDefenseAlertId": "DeviceCustomString4"
        },
        "severity": "Medium",
        "entityMappings": [
          {
            "entityType": "IP",
            "fieldMappings": [
              {
                "identifier": "Address",
                "columnName": "DestinationIP"
              }
            ]
          },
          {
            "entityType": "IP",
            "fieldMappings": [
              {
                "identifier": "Address",
                "columnName": "SourceIP"
              }
            ]
          },
          {
            "entityType": "Host",
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "DestinationHostName"
              }
            ]
          },
          {
            "entityType": "Host",
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "SourceHostName"
              }
            ]
          },
          {
            "entityType": "URL",
            "fieldMappings": [
              {
                "identifier": "Url",
                "columnName": "RequestURL"
              }
            ]
          }
        ],
        "name": "Create Incidents from IronDefense",
        "status": "Available"
      }
    }
  ]
}
