{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5b6ae038-f66e-4f74-9315-df52fd492be4')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5b6ae038-f66e-4f74-9315-df52fd492be4')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "entityMappings": [
          {
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "DvcHostname"
              }
            ],
            "entityType": "Host"
          },
          {
            "fieldMappings": [
              {
                "identifier": "Address",
                "columnName": "DvcIpAddr"
              }
            ],
            "entityType": "IP"
          },
          {
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "ActorUsername"
              }
            ],
            "entityType": "Account"
          }
        ],
        "severity": "Low",
        "name": "Potential re-named sdelete usage (ASIM Version)",
        "triggerOperator": "gt",
        "queryPeriod": "1h",
        "triggerThreshold": 0,
        "tactics": [
          "DefenseEvasion",
          "Impact"
        ],
        "queryFrequency": "1h",
        "description": "'This detection looks for command line parameters associated with the use of Sysinternals sdelete (https://docs.microsoft.com/sysinternals/downloads/sdelete) to delete multiple files on a host's C drive.\nA threat actor may re-name the tool to avoid detection and then use it for destructive attacks on a host.\nThis detection uses the ASIM imProcess parser, this will need to be deployed before use - https://docs.microsoft.com/azure/sentinel/normalization'\n",
        "query": "imProcess\n  | where CommandLine has_all (\"accepteula\", \"-s\", \"-r\", \"-q\")\n  | where Process !endswith \"sdelete.exe\"\n  | where CommandLine !has \"sdelete\"\n"
      }
    }
  ]
}
