{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/29bf5bcd-6795-4c79-a91f-aaef5a618bab')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/29bf5bcd-6795-4c79-a91f-aaef5a618bab')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "triggerThreshold": 0,
        "severity": "Medium",
        "suppressionEnabled": true,
        "suppressionDuration": "5h",
        "query": "let dt_lookBack = 1d; // Data lookback for DnsEvents\nlet ioc_lookBack = 14d; // TI lookback\n// Latest, active, non-expired Lumen domain indicators\nlet Domain_Indicators = ThreatIntelIndicators\n  | where TimeGenerated >= ago(ioc_lookBack)\n  | where IsActive == true and ValidUntil > now()\n  | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by Id\n  | where SourceSystem == 'Lumen'\n  | where ObservableKey == 'domain-name:value' or ObservableValue contains '.'\n  | extend TI_domainEntity = tostring(ObservableValue);\nDomain_Indicators\n| join kind=innerunique (\n    DnsEvents\n    | where TimeGenerated >= ago(dt_lookBack)\n    | extend DNS_domainEntity = Name\n    | extend DnsEvents_TimeGenerated = TimeGenerated\n  ) on $left.TI_domainEntity == $right.DNS_domainEntity\n| where DnsEvents_TimeGenerated < ValidUntil\n| summarize arg_max(DnsEvents_TimeGenerated, *), StartTime = min(DnsEvents_TimeGenerated), EndTime = max(DnsEvents_TimeGenerated) by Id, DNS_domainEntity\n| project timestamp = EndTime, StartTime, EndTime, Name, QueryType, Computer, Id, Tags, ValidUntil, Confidence, TI_domainEntity, DNS_domainEntity, Type\n",
        "displayName": "Lumen TI domain in DnsEvents",
        "queryFrequency": "4h",
        "name": "Lumen TI domain in DnsEvents",
        "description": "This query searches for matches between Lumen threat intelligence domain indicators and DnsEvents.\n",
        "triggerOperator": "gt",
        "queryPeriod": "14d",
        "entityMappings": [
          {
            "fieldMappings": [
              {
                "columnName": "DNS_domainEntity",
                "identifier": "DomainName"
              }
            ],
            "entityType": "DNS"
          }
        ],
        "tactics": [
          "CommandAndControl"
        ]
      }
    }
  ]
}
