{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/0e96c419-68eb-4235-947e-7e86e136cda0')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/0e96c419-68eb-4235-947e-7e86e136cda0')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "triggerOperator": "gt",
        "suppressionDuration": "5h",
        "name": "Lumen TI IPAddress in OfficeActivity",
        "queryFrequency": "4h",
        "triggerThreshold": 0,
        "tactics": [
          "CommandAndControl"
        ],
        "entityMappings": [
          {
            "fieldMappings": [
              {
                "columnName": "OA_ipEntity",
                "identifier": "Address"
              }
            ],
            "entityType": "IP"
          }
        ],
        "displayName": "Lumen TI IPAddress in OfficeActivity",
        "severity": "Medium",
        "suppressionEnabled": true,
        "description": "This query maps Lumen IP indicators of compromise (IOCs) from threat intelligence (TI), by searching for matches in OfficeActivity.\n",
        "queryPeriod": "14d",
        "query": "let dt_lookBack = 1d;  // Data lookback for OfficeActivity\nlet ioc_lookBack = 14d; // TI lookback\nlet IP_Indicators = ThreatIntelIndicators\n  | where TimeGenerated >= ago(ioc_lookBack)\n  | where IsActive == true and ValidUntil > now()\n  | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by Id\n  | where SourceSystem == 'Lumen'\n  | where ObservableKey == 'ipv4-addr:value'\n  | extend TI_ipEntity = ObservableValue\n  | where ipv4_is_private(TI_ipEntity) == false and TI_ipEntity !startswith 'fe80' and TI_ipEntity !startswith '::' and TI_ipEntity !startswith '127.';\nIP_Indicators\n| join kind=innerunique (\n    OfficeActivity\n    | where TimeGenerated >= ago(dt_lookBack)\n    | extend OA_ipEntity = ClientIP\n    | extend OfficeActivity_TimeGenerated = TimeGenerated\n  ) on $left.TI_ipEntity == $right.OA_ipEntity\n| where OfficeActivity_TimeGenerated < ValidUntil\n| summarize arg_max(OfficeActivity_TimeGenerated, *), StartTime = min(OfficeActivity_TimeGenerated), EndTime = max(OfficeActivity_TimeGenerated) by Id, OA_ipEntity\n| project timestamp = EndTime, StartTime, EndTime, UserId, ClientIP, Operation, Id, Tags, ValidUntil, Confidence, TI_ipEntity, OA_ipEntity, Type\n"
      }
    }
  ]
}
