{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f8577e4d-8481-437b-a94e-06f615985668')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f8577e4d-8481-437b-a94e-06f615985668')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "entityMappings": [
          {
            "fieldMappings": [
              {
                "columnName": "Name",
                "identifier": "Name"
              },
              {
                "columnName": "UpnSuffix",
                "identifier": "UPNSuffix"
              }
            ],
            "entityType": "Account"
          },
          {
            "fieldMappings": [
              {
                "columnName": "SourceIpAddress",
                "identifier": "Address"
              }
            ],
            "entityType": "IP"
          }
        ],
        "queryFrequency": "15m",
        "tactics": [
          "Execution"
        ],
        "severity": "Medium",
        "triggerThreshold": 0,
        "triggerOperator": "gt",
        "query": "AWSCloudTrail\n| where EventName == \"ModifyInstanceAttribute\" or EventName == \"CreateLaunchTemplate\"\n| where RequestParameters contains \"userData\"\n| extend userData_ = tostring(parse_json(RequestParameters).userData)\n| extend instanceId_ = tostring(parse_json(RequestParameters).instanceId)\n| project-away  SourceSystem,Category,Type,TenantId,EventVersion,SessionIssuerAccountId\n| extend UserName = substring(UserIdentityPrincipalid, indexof_regex(UserIdentityPrincipalid, \":\") + 1)\n| extend Name = split(UserName,'@')[0],UpnSuffix = split(UserName,'@')[1]\n",
        "queryPeriod": "15m",
        "description": "'Detects changes to the EC2 startup script. The shell script will be executed as root/SYSTEM every time the specific instances are booted up. ref : https://github.com/RhinoSecurityLabs/pacu/blob/master/pacu/modules/ec2__startup_shell_script/main.py'\n",
        "name": "EC2 Startup Shell Script Changed",
        "status": "Available"
      }
    }
  ]
}
