{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f8577e4d-8481-437b-a94e-06f615985668')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f8577e4d-8481-437b-a94e-06f615985668')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "status": "Available",
        "description": "Identifies changes to the EC2 startup script. The shell script will be executed as root/SYSTEM every time the specific instances are booted up. ref : https://github.com/RhinoSecurityLabs/pacu/blob/master/pacu/modules/ec2__startup_shell_script/main.py\n",
        "customDetails": {
          "InstanceId": "instanceId_",
          "EventSource": "EventSource",
          "AWSRegion": "AWSRegion",
          "EventType": "EventTypeName",
          "EventName": "EventName"
        },
        "queryFrequency": "15m",
        "entityMappings": [
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "columnName": "Name",
                "identifier": "Name"
              },
              {
                "columnName": "UpnSuffix",
                "identifier": "UPNSuffix"
              }
            ]
          },
          {
            "entityType": "IP",
            "fieldMappings": [
              {
                "columnName": "SourceIpAddress",
                "identifier": "Address"
              }
            ]
          }
        ],
        "triggerThreshold": 0,
        "queryPeriod": "15m",
        "alertDetailsOverride": {
          "alertDisplayNameFormat": "EC2 startup script changed on {{instanceId_}} by {{UserName}}",
          "alertDescriptionFormat": "EC2 startup script changed on {{instanceId_}} by {{UserName}} in {{AWSRegion}}."
        },
        "name": "AWSCloudTrail - EC2 Startup Shell Script Changed",
        "triggerOperator": "gt",
        "tactics": [
          "Execution"
        ],
        "query": "AWSCloudTrail\n| where EventName in~ (\"ModifyInstanceAttribute\", \"CreateLaunchTemplate\")\n| extend RequestParametersJson = parse_json(RequestParameters)\n| where tostring(RequestParametersJson.userData) != \"\"\n| extend userData_ = tostring(RequestParametersJson.userData)\n| extend instanceId_ = tostring(RequestParametersJson.instanceId)\n| project-away SourceSystem, Category, Type, TenantId, EventVersion, SessionIssuerAccountId\n| extend UserName = substring(UserIdentityPrincipalid, indexof_regex(UserIdentityPrincipalid, \":\") + 1)\n| extend Name = split(UserName,'@')[0],UpnSuffix = split(UserName,'@')[1]\n| project TimeGenerated, EventName, UserName, Name, UpnSuffix, instanceId_, AWSRegion, SourceIpAddress, EventSource, UserIdentityArn, EventTypeName\n",
        "severity": "Medium"
      }
    }
  ]
}
