{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/26e81021-2de6-4442-a74a-a77885e96911')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/26e81021-2de6-4442-a74a-a77885e96911')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "alertDetailsOverride": {
          "alertDisplayNameFormat": "Possible exploitation of CVE-2023-4863",
          "alertDynamicProperties": []
        },
        "status": "Available",
        "query": "//CVE-2023-4863 Process activity with .webp files on devices where CVE-2023-4863 is unpatched\n//This query shows all process activity with .webp files on vulnerable machines and is not an indicator of malicious activity\nlet VulnDevices = DeviceTvmSoftwareVulnerabilities\n    | where CveId == \"CVE-2023-4863\"\n    | distinct DeviceId;\nunion DeviceProcessEvents, DeviceNetworkEvents, DeviceEvents\n| where DeviceId in (VulnDevices) and InitiatingProcessCommandLine has(\".webp\") or ProcessCommandLine has(\".webp\")",
        "entityMappings": [
          {
            "fieldMappings": [
              {
                "identifier": "HostName",
                "columnName": "DeviceName"
              }
            ],
            "entityType": "Host"
          },
          {
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "AccountName"
              }
            ],
            "entityType": "Account"
          },
          {
            "fieldMappings": [
              {
                "identifier": "ProcessId",
                "columnName": "ProcessId"
              }
            ],
            "entityType": "Process"
          },
          {
            "fieldMappings": [
              {
                "identifier": "ProcessId",
                "columnName": "InitiatingProcessId"
              }
            ],
            "entityType": "Process"
          },
          {
            "fieldMappings": [
              {
                "identifier": "CommandLine",
                "columnName": "ProcessCommandLine"
              }
            ],
            "entityType": "Process"
          }
        ],
        "triggerOperator": "gt",
        "queryPeriod": "1h",
        "name": "Execution of software vulnerable to webp buffer overflow of CVE-2023-4863",
        "suppressionEnabled": false,
        "tactics": [
          "Execution"
        ],
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "queryFrequency": "1h",
        "severity": "Informational",
        "description": "'This query looks at device, process, and network events from Defender for Endpoint that may be vulnerable to buffer overflow defined in CVE-2023-4863. Results are not an indicator of malicious activity.'\n",
        "triggerThreshold": 0,
        "suppressionDuration": "5h",
        "incidentConfiguration": {
          "groupingConfiguration": {
            "enabled": false,
            "reopenClosedIncident": false,
            "groupByEntities": [
              "Account"
            ],
            "matchingMethod": "Selected",
            "groupByAlertDetails": [],
            "groupByCustomDetails": [],
            "lookbackDuration": "5h"
          },
          "createIncident": false
        }
      }
    }
  ]
}
