{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/2d5efc71-2e91-4ca2-8506-857eecb453ec')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/2d5efc71-2e91-4ca2-8506-857eecb453ec')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "severity": "Medium",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFileName =~ \"dllhost.exe\"\n| where ProcessIntegrityLevel == \"High\"\n| where InitiatingProcessCommandLine has_any (\"E9495B87-D950-4AB5-87A5-FF6D70BF3E90\", \"3E5FC7F9-9A51-4367-9063-A120244FBEC7\", \"D2E7041B-2927-42fb-8E9F-7CE93B6DC937\")\n",
        "name": "Detecting UAC bypass - elevated COM interface",
        "triggerThreshold": 0,
        "entityMappings": [
          {
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "DeviceName"
              }
            ],
            "entityType": "Host"
          },
          {
            "fieldMappings": [
              {
                "identifier": "Sid",
                "columnName": "AccountSid"
              },
              {
                "identifier": "Name",
                "columnName": "AccountName"
              },
              {
                "identifier": "NTDomain",
                "columnName": "AccountDomain"
              }
            ],
            "entityType": "Account"
          },
          {
            "fieldMappings": [
              {
                "identifier": "CommandLine",
                "columnName": "ProcessCommandLine"
              }
            ],
            "entityType": "Process"
          }
        ],
        "queryPeriod": "1h",
        "queryFrequency": "1h",
        "tactics": [
          "Impact"
        ],
        "description": "This query identifies processes spawned with high integrity from dllhost.exe with a command line that contains one of three specific CLSID GUIDs.\n",
        "status": "Available",
        "triggerOperator": "gt"
      }
    }
  ]
}
