{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/8b8fbf9c-35d4-474b-8151-a40173521293')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8b8fbf9c-35d4-474b-8151-a40173521293')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "triggerOperator": "gt",
        "queryFrequency": "1h",
        "tactics": [
          "Impact"
        ],
        "name": "Detecting UAC bypass - modify Windows Store settings",
        "query": "DeviceProcessEvents\n| where InitiatingProcessFileName =~ \"wsreset.exe\"\n| where ProcessIntegrityLevel == \"High\"\n",
        "queryPeriod": "1h",
        "description": "This query identifies modification a specific registry key and then launching wsreset.exe that resets the Windows Store settings.\n",
        "severity": "Medium",
        "status": "Available",
        "entityMappings": [
          {
            "entityType": "Host",
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "DeviceName"
              }
            ]
          },
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "identifier": "Sid",
                "columnName": "AccountSid"
              },
              {
                "identifier": "Name",
                "columnName": "AccountName"
              },
              {
                "identifier": "NTDomain",
                "columnName": "AccountDomain"
              }
            ]
          },
          {
            "entityType": "Process",
            "fieldMappings": [
              {
                "identifier": "CommandLine",
                "columnName": "ProcessCommandLine"
              }
            ]
          }
        ],
        "triggerThreshold": 0
      }
    }
  ]
}
