{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/26e81021-2de6-4442-a74a-a77885e96911')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/26e81021-2de6-4442-a74a-a77885e96911')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "name": "Execution of software vulnerable to webp buffer overflow of CVE-2023-4863",
        "suppressionEnabled": false,
        "suppressionDuration": "PT5H",
        "query": "//CVE-2023-4863 Process activity with .webp files on devices where CVE-2023-4863 is unpatched\n//This query shows all process activity with .webp files on vulnerable machines and is not an indicator of malicious activity\nlet VulnDevices = DeviceTvmSoftwareVulnerabilities\n    | where CveId == \"CVE-2023-4863\"\n    | distinct DeviceId;\nunion DeviceProcessEvents, DeviceNetworkEvents, DeviceEvents\n| where DeviceId in (VulnDevices) and (InitiatingProcessCommandLine has(\".webp\") or ProcessCommandLine has(\".webp\"))\n| extend Name = tostring(split(AccountUpn, \"@\")[0]), UPNSuffix = tostring(split(AccountUpn, \"@\")[1])\n| extend HostName = tostring(split(DeviceName, \".\")[0]), DomainIndex = toint(indexof(DeviceName, '.'))\n| extend HostNameDomain = iff(DomainIndex != -1, substring(DeviceName, DomainIndex + 1), DeviceName)",
        "entityMappings": [
          {
            "entityType": "Host",
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "DeviceName"
              },
              {
                "identifier": "HostName",
                "columnName": "HostName"
              },
              {
                "identifier": "DnsDomain",
                "columnName": "HostNameDomain"
              }
            ]
          },
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "AccountUpn"
              },
              {
                "identifier": "Name",
                "columnName": "Name"
              },
              {
                "identifier": "UPNSuffix",
                "columnName": "UPNSuffix"
              }
            ]
          },
          {
            "entityType": "IP",
            "fieldMappings": [
              {
                "identifier": "Address",
                "columnName": "LocalIP"
              }
            ]
          },
          {
            "entityType": "Process",
            "fieldMappings": [
              {
                "identifier": "ProcessId",
                "columnName": "ProcessId"
              }
            ]
          },
          {
            "entityType": "Process",
            "fieldMappings": [
              {
                "identifier": "ProcessId",
                "columnName": "InitiatingProcessId"
              }
            ]
          },
          {
            "entityType": "Process",
            "fieldMappings": [
              {
                "identifier": "CommandLine",
                "columnName": "ProcessCommandLine"
              }
            ]
          }
        ],
        "description": "'This query looks at device, process, and network events from Defender for Endpoint that may be vulnerable to buffer overflow defined in CVE-2023-4863. Results are not an indicator of malicious activity.'\n",
        "tactics": [
          "Execution"
        ],
        "severity": "Informational",
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "triggerThreshold": 0,
        "queryFrequency": "1h",
        "status": "Available",
        "queryPeriod": "1h",
        "incidentConfiguration": {
          "groupingConfiguration": {
            "groupByAlertDetails": [],
            "reopenClosedIncident": false,
            "matchingMethod": "Selected",
            "groupByCustomDetails": [],
            "enabled": false,
            "groupByEntities": [
              "Account"
            ],
            "lookbackDuration": "PT5H"
          },
          "createIncident": false
        },
        "alertDetailsOverride": {
          "alertDynamicProperties": [],
          "alertDisplayNameFormat": "Possible exploitation of CVE-2023-4863"
        },
        "triggerOperator": "gt"
      }
    }
  ]
}
