{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/639aa695-9de9-4921-aa6b-6fdc35cb1eee')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/639aa695-9de9-4921-aa6b-6fdc35cb1eee')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "triggerOperator": "gt",
        "query": "AuditLogs \n| where OperationName contains \"Update user\"\n| where TargetResources[0].modifiedProperties[0].oldValue contains \"Guest\"\n| extend InvitedUser = TargetResources[0].userPrincipalName\n// Uncomment the below line if you want to get alerts for changed usertype from specific domains or users\n//| where InvitedUser has_any (\"CUSTOM DOMAIN NAME#\", \"#EXT#\")\n| extend InitiatedByActionUserInformation = iff(isnotempty(InitiatedBy.user.userPrincipalName), InitiatedBy.user.userPrincipalName, InitiatedBy.app.displayName)\n| extend InitiatedByIPAdress = InitiatedBy.user.ipAddress \n| extend OldUserType = TargetResources[0].modifiedProperties[0].oldValue contains \"Guest\"\n| extend NewUserType = TargetResources[0].modifiedProperties[0].newValue contains \"Member\"\n| mv-expand OldUserType = TargetResources[0].modifiedProperties[0].oldValue to typeof(string)\n| mv-expand NewUserType = TargetResources[0].modifiedProperties[0].newValue to typeof(string)\n| where OldUserType != NewUserType\n",
        "status": "Available",
        "tactics": [
          "InitialAccess",
          "Persistence",
          "Discovery"
        ],
        "description": "'Guest Accounts are added in the Organization Tenants to perform various tasks i.e projects execution, support etc.. This detection notifies when guest users are changed from user type as should be in AzureAD to member and gain other rights in the tenant.'\n",
        "entityMappings": [
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "columnName": "InvitedUser",
                "identifier": "FullName"
              }
            ]
          },
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "columnName": "InitiatedByActionUserInformation",
                "identifier": "Name"
              }
            ]
          },
          {
            "entityType": "IP",
            "fieldMappings": [
              {
                "columnName": "InitiatedByIPAdress",
                "identifier": "Address"
              }
            ]
          }
        ],
        "severity": "Medium",
        "name": "Guest accounts changed user type from guest to members in AzureAD",
        "queryPeriod": "1d",
        "triggerThreshold": 0,
        "queryFrequency": "1d"
      }
    }
  ]
}
