{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/9ae540c9-c926-4100-8f07-1eac22596292')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/9ae540c9-c926-4100-8f07-1eac22596292')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "triggerThreshold": 0,
        "entityMappings": [
          {
            "fieldMappings": [
              {
                "identifier": "Name",
                "columnName": "UserName"
              }
            ],
            "entityType": "Account"
          }
        ],
        "name": "Silverfort - Certifried Incident",
        "tactics": [
          "PrivilegeEscalation"
        ],
        "severity": "High",
        "queryPeriod": "15m",
        "description": "'An Active Directory domain privilege escalation vulnerability that enables a privileged user to access the Domain Controller by abusing Active Directory Certificate Service'\n",
        "query": "CommonSecurityLog \n| where DeviceVendor has 'Silverfort'\n| where DeviceProduct has 'Admin Console'\n| where DeviceEventClassID == \"NewIncident\"\n| where Message has \"Certifried\"\n| extend UserName = parse_json(replace('^\"\"|\"\"$', '', Message))['userName']",
        "queryFrequency": "15m",
        "triggerOperator": "gt"
      }
    }
  ]
}
