{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/bdfd2c45-10a0-44e7-a90a-ba7b6bdd9ff2')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/bdfd2c45-10a0-44e7-a90a-ba7b6bdd9ff2')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "queryFrequency": "15m",
        "entityMappings": [
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "columnName": "UserName",
                "identifier": "Name"
              }
            ]
          }
        ],
        "triggerThreshold": 0,
        "description": "'The NoPac vulnerability involves privilege escalation, allowing attackers to gain unauthorized access and potentially take control of an entire Active Directory domain'\n",
        "name": "Silverfort - NoPacBreach Incident",
        "triggerOperator": "gt",
        "tactics": [
          "PrivilegeEscalation"
        ],
        "severity": "High",
        "query": "CommonSecurityLog \n| where DeviceVendor has 'Silverfort'\n| where DeviceProduct has 'Admin Console'\n| where DeviceEventClassID == \"NewIncident\"\n| where Message has \"NoPacBreach\"\n| extend UserName = parse_json(replace('^\"\"|\"\"$', '', Message))['userName']",
        "queryPeriod": "15m"
      }
    }
  ]
}
