{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/46ff357b-9e98-465b-9e45-cd52fa4a7522')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/46ff357b-9e98-465b-9e45-cd52fa4a7522')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "entityMappings": [
          {
            "fieldMappings": [
              {
                "columnName": "UserName",
                "identifier": "Name"
              }
            ],
            "entityType": "Account"
          }
        ],
        "queryFrequency": "15m",
        "tactics": [
          "CredentialAccess"
        ],
        "severity": "High",
        "triggerThreshold": 0,
        "triggerOperator": "gt",
        "query": "CommonSecurityLog \n| where DeviceVendor has 'Silverfort'\n| where DeviceProduct has 'Admin Console'\n| where DeviceEventClassID == \"NewIncident\"\n| where Message has \"UserBruteForce\"\n| extend UserName = parse_json(replace('^\"\"|\"\"$', '', Message))['userName']",
        "queryPeriod": "15m",
        "description": "'A security weakness that allows attackers to gain unauthorized access to user accounts by systematically guessing the username and password combinations.'\n",
        "name": "Silverfort - UserBruteForce Incident"
      }
    }
  ]
}
