{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/4bd7e93a-0646-4e02-8dcb-aa16d16618f4')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/4bd7e93a-0646-4e02-8dcb-aa16d16618f4')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "query": "// Define a threshold (distinct_user_launch_threshold) for\n// the minimum number of users who launched an app\n// to be in scope of this detection\nlet distinct_user_launch_threshold = 2;\n// Define a threshold for the minumum number of users\n// who clicked the same malicious link after launching the app\n// to be in scope of this detection\nlet distinct_user_url_click_threshold = 2;\nlet query_frequency = 1h;\nlet query_lookback = 14d;\nlet new_app_creation_activity = materialize(\n    PowerPlatformAdminActivity\n    | where TimeGenerated >= ago (query_lookback)\n    | where EventOriginalType == \"CreatePowerApp\"\n    | extend Properties = tostring(PropertyCollection)\n    | extend SrcIpAddr = extract(@'\"enduser.ip_address\",\"Value\":\"([^\"]+)\"', 1, Properties)\n    | extend SrcIpAddr = iif(SrcIpAddr startswith '::ffff:', replace_string(SrcIpAddr, '::ffff:', ''), SrcIpAddr)\n    | extend AppId = extract(@'\"powerplatform.analytics.resource.power_app.id\",\"Value\":\"([^\"]+)\"', 1, Properties)\n    | extend AppId = tolower(replace_string(AppId, '/providers/Microsoft.PowerApps/apps/', ''))\n    | extend\n        AppName = extract(@'\"powerplatform.analytics.resource.power_app.display_name\",\"Value\":\"([^\"]+)\"', 1, Properties),\n        EnvironmentId = extract(@'\"powerplatform.analytics.resource.environment.id\",\"Value\":\"([^\"]+)\"', 1, Properties)\n    | project-rename\n        AppCreatedTime = TimeGenerated,\n        AppCreator = ActorName,\n        AppCreatorIpAddr = SrcIpAddr\n    );\nlet distinct_apps = new_app_creation_activity\n    | distinct AppName;\nlet new_app_launch_activity = materialize(\n    new_app_creation_activity\n    | join kind=inner (\n        PowerPlatformAdminActivity\n        | where TimeGenerated >= ago (query_lookback)\n        | where EventOriginalType == \"LaunchPowerApp\"\n        | where PropertyCollection has_any (distinct_apps)\n        | extend Properties = tostring(PropertyCollection)\n        | extend AppName = extract(@'\"powerplatform.analytics.resource.power_app.display_name\",\"Value\":\"([^\"]+)\"', 1, Properties)\n        | summarize FirstAppLaunchTime = min(TimeGenerated) by ActorName, AppName)\n        on AppName\n    | where FirstAppLaunchTime > AppCreatedTime\n    );\nlet new_app_launch_users = new_app_launch_activity\n    | summarize LaunchCount = dcount(ActorName) by AppName\n    | where LaunchCount > distinct_user_launch_threshold\n    | join kind=inner new_app_launch_activity on AppName\n    | summarize\n        by\n        ActorName,\n        FirstAppLaunchTime,\n        AppName,\n        AppId,\n        EnvironmentId,\n        AppCreator,\n        AppCreatorIpAddr;\nlet detected_urls = union isfuzzy=true\n        (\n        SecurityAlert\n        | where TimeGenerated >= ago (query_lookback)\n        | where Entities has_cs '\"Type\":\"url\"'\n        | mv-expand todynamic(Entities)\n        | where tostring(Entities.Type) == \"url\"\n        | project Url = tostring(Entities.Url), Source = \"SecurityAlert\"\n        ),\n        (\n        ThreatIntelligenceIndicator\n        | where TimeGenerated >= ago(query_lookback)\n        | summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by IndicatorId\n        | where Active == true and ExpirationDateTime > now()\n        | where isnotempty(isnotempty(Url))\n        | project Url, Source = \"ThreatIntelligence\"\n        )\n    | summarize by Url, Source;\nlet url_click_events = materialize(\n    union isfuzzy=true\n        (\n        UrlClickEvents\n        | where TimeGenerated >= ago(query_frequency)\n        | where isnotempty(ThreatTypes)\n        | join kind=inner (new_app_launch_users) on $left.AccountUpn == $right.ActorName\n        | where TimeGenerated between (FirstAppLaunchTime .. (FirstAppLaunchTime + 1h))\n        | summarize by ActorName, Url, Source = \"MicrosoftDefender\"\n        ),\n        (\n        _Im_WebSession\n        | where TimeGenerated >= ago(query_frequency)\n        | join kind=inner (new_app_launch_users) on $left.SrcUsername == $right.ActorName\n        | join kind=inner (detected_urls) on Url\n        | where TimeGenerated between (FirstAppLaunchTime .. (FirstAppLaunchTime + 1h))\n        | summarize by ActorName, Url, Source\n        )\n    );\nlet distinct_url_click_events_count = toscalar(\n    url_click_events\n    | summarize DistinctUserCount = dcount(ActorName) by Url\n    | where DistinctUserCount > distinct_user_url_click_threshold\n    | summarize sum(DistinctUserCount)\n    );\nurl_click_events\n| summarize DistinctUserCount = dcount(ActorName) by Url\n| where DistinctUserCount >= distinct_user_url_click_threshold\n| join kind=inner url_click_events on Url\n| join kind=inner (new_app_launch_users) on ActorName\n| extend\n    PowerAppsEntityId = 27593,\n    DataverseId = 32780,\n    AccountName = tostring(split(ActorName, '@')[0]),\n    UPNSuffix = tostring(split(ActorName, '@')[1])\n| project\n    FirstAppLaunchTime,\n    AppCreator,\n    AppName,\n    AppId,\n    ImpactedUser = ActorName,\n    AccountName,\n    UPNSuffix,\n    EnvironmentId,\n    Url,\n    Source,\n    PowerAppsEntityId\n",
        "status": "Available",
        "description": "Identifies a chain of events, where a new Power App is created, followed by mulitple users launching the app within the detection window and clicking on the same malicious URL.",
        "queryFrequency": "1h",
        "queryPeriod": "14d",
        "tactics": [
          "InitialAccess"
        ],
        "name": "Power Apps - Multiple users access a malicious link after launching new app",
        "alertDetailsOverride": {
          "alertDisplayNameFormat": "Possible malicious app detected - {{AppName}} ",
          "alertDescriptionFormat": "Multiple users opened a malicious link after launching app {{AppName}}.  Click here to navigate to the Power Apps Portal to examine the app: https://make.powerapps.com/environments/{{EnvironmentId}}/apps"
        },
        "customDetails": {
          "PowerAppsApp": "AppId",
          "PowerAppsAppName": "AppName",
          "Environment": "EnvironmentId",
          "AppCreator": "AppCreator"
        },
        "triggerThreshold": 0,
        "severity": "High",
        "triggerOperator": "gt",
        "eventGroupingSettings": {
          "aggregationKind": "AlertPerResult"
        },
        "entityMappings": [
          {
            "entityType": "CloudApplication",
            "fieldMappings": [
              {
                "columnName": "PowerAppsEntityId",
                "identifier": "AppId"
              },
              {
                "columnName": "AppName",
                "identifier": "InstanceName"
              }
            ]
          },
          {
            "entityType": "URL",
            "fieldMappings": [
              {
                "columnName": "Url",
                "identifier": "Url"
              }
            ]
          },
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "columnName": "AppCreator",
                "identifier": "FullName"
              }
            ]
          },
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "columnName": "UPNSuffix",
                "identifier": "UPNSuffix"
              },
              {
                "columnName": "AccountName",
                "identifier": "Name"
              }
            ]
          }
        ]
      }
    }
  ]
}
