{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a34d0338-eda0-42b5-8b93-32aae0d7a501')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/a34d0338-eda0-42b5-8b93-32aae0d7a501')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "entityMappings": [
          {
            "fieldMappings": [
              {
                "columnName": "Activity",
                "identifier": "DomainName"
              }
            ],
            "entityType": "DNS"
          }
        ],
        "tactics": [
          "LateralMovement",
          "CommandAndControl"
        ],
        "description": "'Identifies when a new Campaign has been detected.  This occurs when multiple Detections accross different Hosts are suspected to be part of the same Attack Campaign.'\n",
        "queryFrequency": "5m",
        "queryPeriod": "5m",
        "triggerThreshold": 0,
        "triggerOperator": "gt",
        "status": "Available",
        "alertDetailsOverride": {
          "alertDynamicProperties": [
            {
              "alertProperty": "AlertLink",
              "value": "vectra_URL"
            },
            {
              "alertProperty": "ProductName",
              "value": "DeviceProduct"
            },
            {
              "alertProperty": "ProviderName",
              "value": "DeviceVendor"
            }
          ],
          "alertDisplayNameFormat": "Vectra AI - New Campaign Detected",
          "alertDescriptionFormat": "A new campaign named {{Activity}} has been detected (reason is {{reason}})\n"
        },
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Vectra Networks\"\n| where DeviceProduct == \"X Series\"\n| where DeviceEventClassID contains \"campaign\"\n| where DeviceAction == \"START\"\n| extend reason = coalesce(\n                          column_ifexists(\"Reason\", \"\"), \n                          extract(\"reason=(.+?)($|;)\", 1, AdditionalExtensions),\n                          \"\"\n                      )\n| project-rename vectra_URL = DeviceCustomString4\n| sort by TimeGenerated\n",
        "severity": "Medium",
        "customDetails": {
          "CampaignSourceHost": "SourceHostName",
          "CampaignName": "Activity",
          "CampaignReason": "reason"
        },
        "incidentConfiguration": {
          "createIncident": true,
          "groupingConfiguration": {
            "reopenClosedIncident": true,
            "matchingMethod": "AllEntities",
            "lookbackDuration": "7d",
            "enabled": true
          }
        },
        "name": "Vectra AI Detect - New Campaign Detected"
      }
    }
  ]
}
