{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/760b8467-e6cc-4006-9149-5696845c1a54')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/760b8467-e6cc-4006-9149-5696845c1a54')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "name": "Failed sign-ins into LastPass due to MFA",
        "triggerThreshold": 0,
        "tactics": [
          "InitialAccess"
        ],
        "entityMappings": [
          {
            "fieldMappings": [
              {
                "columnName": "AccountCustomEntity",
                "identifier": "Name"
              }
            ],
            "entityType": "Account"
          },
          {
            "fieldMappings": [
              {
                "columnName": "IPCustomEntity",
                "identifier": "Address"
              }
            ],
            "entityType": "IP"
          }
        ],
        "eventGroupingSettings": {
          "aggregationKind": "AlertPerResult"
        },
        "description": "'This rule will check if a sign-in failed into LastPass due to MFA.\nAn incident can indicate the potential brute forcing of a LastPass account. \nThe use of MFA is identified by combining the sign-in logs, this rule assumes LastPass is federated to Entra ID.'\n",
        "triggerOperator": "gt",
        "query": "LastPassNativePoller_CL\n| where Action_s == \"Log in\"\n| join (SigninLogs | where AppDisplayName == \"LastPass Enterprise\") on $left.IP_Address_s == $right.IPAddress and $left.Username_s == $right.UserPrincipalName\n| where ResultType in (50074, 50076)\n| extend AccountCustomEntity = Username_s, IPCustomEntity = IP_Address_s\n",
        "queryPeriod": "1d",
        "queryFrequency": "1d",
        "severity": "Low",
        "status": "Available"
      }
    }
  ]
}
