{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/7d7e20f8-3384-4b71-811c-f5e950e8306c')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/7d7e20f8-3384-4b71-811c-f5e950e8306c')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "query": "AuditLogs\n| where ActivityDisplayName =~'Add member to role completed (PIM activation)'\n| where Result == \"failure\"\n| extend Role = tostring(TargetResources[0].displayName)\n| extend User = tostring(TargetResources[2].displayName)\n| extend InitiatedUserDetail = parse_json(tostring(InitiatedBy.user)), InitiatedAppDetail = parse_json(tostring(InitiatedBy.app))\n| extend InitiatingUser = tostring(coalesce(InitiatedUserDetail.userPrincipalName, InitiatedAppDetail.displayName))\n| project-reorder TimeGenerated, InitiatingUser, User, Role, OperationName, Result, ResultDescription\n| extend AccountCustomEntity = User, IPCustomEntity = tostring(InitiatedUserDetail.ipAddress)\n| project-away InitiatedUserDetail, InitiatedAppDetail\n",
        "name": "PIM Elevation Request Rejected",
        "triggerOperator": "gt",
        "queryFrequency": "2h",
        "tactics": [
          "Persistence"
        ],
        "triggerThreshold": 0,
        "queryPeriod": "2h",
        "status": "Available",
        "description": "'Identifies when a user is rejected for a privileged role elevation via PIM. Monitor rejections for indicators of attacker compromise of the requesting account.\nRef : https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-privileged-identity-management'\n",
        "severity": "High",
        "entityMappings": [
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "InitiatingUser"
              }
            ]
          },
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "AccountCustomEntity"
              }
            ]
          },
          {
            "entityType": "IP",
            "fieldMappings": [
              {
                "identifier": "Address",
                "columnName": "IPCustomEntity"
              }
            ]
          }
        ]
      }
    }
  ]
}
