{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5090ad7b-4b47-4cab-9015-bffb43aecde8')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5090ad7b-4b47-4cab-9015-bffb43aecde8')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "name": "Acronis - Multiple Inboxes with Malicious Content Detected",
        "entityMappings": [
          {
            "entityType": "Host",
            "fieldMappings": [
              {
                "columnName": "DeviceName",
                "identifier": "HostName"
              }
            ]
          }
        ],
        "triggerThreshold": 2,
        "triggerOperator": "gt",
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "tactics": [
          "InitialAccess"
        ],
        "customDetails": {
          "DeviceName": "DeviceName"
        },
        "incidentConfiguration": {
          "groupingConfiguration": {
            "enabled": true,
            "reopenClosedIncident": true,
            "matchingMethod": "AnyAlert",
            "lookbackDuration": "P1D"
          },
          "createIncident": true
        },
        "queryFrequency": "1h",
        "severity": "Medium",
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Acronis\"\n| where DeviceEventClassID in\n(\"MaliciousURLDetectedInM365MailboxBackup\",\n\"MalwareDetectedInM365MailboxBackup\",\n\"MaliciousEmailDetectedPerceptionPointWarning\")\n| summarize MaliciousContent = count() by DeviceName\n",
        "description": "Many inboxes containing malicious content could indicate a potential ongoing phishing attack.",
        "queryPeriod": "1d"
      }
    }
  ]
}
