{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1385f0ce-69d9-4abf-8039-52080c8c7017')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/1385f0ce-69d9-4abf-8039-52080c8c7017')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "description": "Multiple endpoints accessing malicious URLs could indicate an ongoing phishing attack, with several employees interacting with those URLs.",
        "name": "Acronis - Multiple Endpoints Accessing Malicious URLs",
        "tactics": [
          "Execution"
        ],
        "triggerThreshold": 2,
        "triggerOperator": "gt",
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Acronis\"\n| where DeviceEventClassID == \"MaliciousUrlDetected\"\n| summarize MaliciousUrlDetected = count() by DeviceName\n",
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "entityMappings": [
          {
            "entityType": "Host",
            "fieldMappings": [
              {
                "columnName": "DeviceName",
                "identifier": "HostName"
              }
            ]
          }
        ],
        "severity": "Medium",
        "customDetails": {
          "DeviceName": "DeviceName"
        },
        "queryPeriod": "1d",
        "incidentConfiguration": {
          "createIncident": true,
          "groupingConfiguration": {
            "matchingMethod": "AnyAlert",
            "enabled": true,
            "reopenClosedIncident": true,
            "lookbackDuration": "P1D"
          }
        },
        "queryFrequency": "1h"
      }
    }
  ]
}
