{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/5090ad7b-4b47-4cab-9015-bffb43aecde8')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/5090ad7b-4b47-4cab-9015-bffb43aecde8')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "queryFrequency": "1h",
        "triggerOperator": "gt",
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Acronis\"\n| where DeviceEventClassID in\n(\"MaliciousURLDetectedInM365MailboxBackup\",\n\"MalwareDetectedInM365MailboxBackup\",\n\"MaliciousEmailDetectedPerceptionPointWarning\")\n| summarize MaliciousContent = count() by DeviceName\n",
        "entityMappings": [
          {
            "entityType": "Host",
            "fieldMappings": [
              {
                "identifier": "HostName",
                "columnName": "DeviceName"
              }
            ]
          }
        ],
        "description": "Many inboxes containing malicious content could indicate a potential ongoing phishing attack.",
        "incidentConfiguration": {
          "createIncident": true,
          "groupingConfiguration": {
            "enabled": true,
            "reopenClosedIncident": true,
            "lookbackDuration": "P1D",
            "matchingMethod": "AnyAlert"
          }
        },
        "severity": "Medium",
        "name": "Acronis - Multiple Inboxes with Malicious Content Detected",
        "queryPeriod": "1d",
        "triggerThreshold": 2,
        "tactics": [
          "InitialAccess"
        ],
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "customDetails": {
          "DeviceName": "DeviceName"
        }
      }
    }
  ]
}
