{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a783ade7-bf43-416d-b809-8f5b06d87790')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/a783ade7-bf43-416d-b809-8f5b06d87790')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "severity": "High",
        "queryPeriod": "1d",
        "tactics": [
          "Impact"
        ],
        "incidentConfiguration": {
          "groupingConfiguration": {
            "matchingMethod": "AnyAlert",
            "lookbackDuration": "P1D",
            "enabled": true,
            "reopenClosedIncident": true
          },
          "createIncident": true
        },
        "triggerOperator": "gt",
        "description": "Detects when three or more distinct endpoints report ransomware detections within a single day.",
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "queryFrequency": "1h",
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Acronis\"\n| where DeviceEventClassID == \"ActiveProtectionBlocksSuspiciousActivity\"\n| summarize ActiveProtectionBlocksSuspiciousActivity = count() by DeviceName\n",
        "customDetails": {
          "DeviceName": "DeviceName"
        },
        "entityMappings": [
          {
            "entityType": "Host",
            "fieldMappings": [
              {
                "columnName": "DeviceName",
                "identifier": "HostName"
              }
            ]
          }
        ],
        "name": "Acronis - Multiple Endpoints Infected by Ransomware",
        "triggerThreshold": 2
      }
    }
  ]
}
