{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/84037130-a623-46c2-9144-0c0955ac4112')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/84037130-a623-46c2-9144-0c0955ac4112')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "eventGroupingSettings": {
          "aggregationKind": "AlertPerResult"
        },
        "triggerThreshold": 0,
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Acronis audit\"\n| extend initiator_ip = tostring(parse_json(DeviceCustomString1).initiator_ip)\n| summarize LoginCount = count() by initiator_ip\n| where LoginCount <= 2\n| order by LoginCount asc\n",
        "description": "Suspicious login from an IP address observed up to two times in the last two weeks.",
        "incidentConfiguration": {
          "createIncident": true,
          "groupingConfiguration": {
            "enabled": true,
            "reopenClosedIncident": true,
            "lookbackDuration": "P7D",
            "groupByEntities": [
              "IP"
            ],
            "matchingMethod": "Selected"
          }
        },
        "triggerOperator": "gt",
        "alertDetailsOverride": {
          "alertDisplayNameFormat": "Acronis - Login from Abnormal IP ({{initiator_ip}}) - Low Occurrence ({{LoginCount}})",
          "alertDynamicProperties": []
        },
        "entityMappings": [
          {
            "fieldMappings": [
              {
                "identifier": "Address",
                "columnName": "initiator_ip"
              }
            ],
            "entityType": "IP"
          }
        ],
        "tactics": [
          "InitialAccess"
        ],
        "severity": "Medium",
        "queryFrequency": "1d",
        "queryPeriod": "14d",
        "name": "Acronis - Login from Abnormal IP - Low Occurrence"
      }
    }
  ]
}
