{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/52aec824-96c1-4a03-8e44-bb70532e6cea')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/52aec824-96c1-4a03-8e44-bb70532e6cea')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "entityMappings": [
          {
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "SubjectAccount"
              }
            ],
            "entityType": "Account"
          },
          {
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "Computer"
              }
            ],
            "entityType": "Host"
          }
        ],
        "name": "AdminSDHolder Modifications",
        "tactics": [
          "Persistence"
        ],
        "description": "'This query detects modification in the AdminSDHolder  in the Active Directory which could indicate an attempt for persistence. \nAdminSDHolder Modification is a persistence technique in which an attacker abuses the SDProp process in Active Directory to establish a persistent backdoor to Active Directory.\nThis query searches for the event id 5136 where the Object DN is AdminSDHolder.\nRef: https://attack.stealthbits.com/adminsdholder-modification-ad-persistence'\n",
        "query": "SecurityEvent\n| where EventID == 5136 and EventData contains \"<Data Name=\\\"ObjectDN\\\">CN=AdminSDHolder,CN=System\"\n| parse EventData with * 'ObjectDN\">' ObjectDN \"<\" *\n| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by Computer, SubjectAccount, SubjectUserSid, SubjectLogonId, ObjectDN\n",
        "metadata": {
          "categories": {
            "domains": [
              "Security - Others"
            ]
          },
          "author": {
            "name": "Vasileios Paschalidis"
          },
          "source": {
            "kind": "Community"
          },
          "support": {
            "tier": "Community"
          }
        },
        "triggerOperator": "gt",
        "severity": "High",
        "triggerThreshold": 0,
        "queryFrequency": "1h",
        "queryPeriod": "1h"
      }
    }
  ]
}
