{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/caa4665f-21fa-462d-bb31-92226e746c68')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/caa4665f-21fa-462d-bb31-92226e746c68')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "status": "Available",
        "alertDetailsOverride": {
          "alertDisplayNameFormat": "(MDIoT) {{AlertName}}",
          "alertDescriptionFormat": "(MDIoT) {{Description}}",
          "alertDynamicProperties": [
            {
              "value": "ProductName",
              "alertProperty": "ProductName"
            },
            {
              "value": "RemediationSteps",
              "alertProperty": "RemediationSteps"
            },
            {
              "value": "Techniques",
              "alertProperty": "Techniques"
            },
            {
              "value": "ProductComponentName",
              "alertProperty": "ProductComponentName"
            },
            {
              "value": "AlertLink",
              "alertProperty": "AlertLink"
            }
          ],
          "alertSeverityColumnName": "AlertSeverity",
          "alertTacticsColumnName": "Tactics"
        },
        "description": "'This alert leverages Defender for IoT to detect an unusually high bandwidth which may be an indication of a new service/process or malicious activity on the network. An example scenario is a cyber threat attempting to manipulate the SCADA network.'\n",
        "query": "SecurityAlert\n| where ProviderName == \"IoTSecurity\"\n| where AlertName in (\"Abnormal Traffic Bandwidth\", \"Abnormal Traffic Bandwidth Between Devices\", \"ARP Spoofing\", \"ICMP Flooding\")\n| extend ExtendedProperties = parse_json(ExtendedProperties)\n| where tostring(ExtendedProperties.isNew) == \"True\"\n| extend DeviceId = tostring(ExtendedProperties.DeviceId), \n         SourceDeviceAddress = tostring(ExtendedProperties.SourceDeviceAddress), \n         DestDeviceAddress = tostring(ExtendedProperties.DestinationDeviceAddress), \n         RemediationSteps = tostring(parse_json(RemediationSteps)[0]), \n         Protocol = tostring(ExtendedProperties.Protocol), \n         AlertManagementUri = tostring(ExtendedProperties.AlertManagementUri)\n| project\n  TimeGenerated,\n  DeviceId,\n  ProductName,\n  ProductComponentName,\n  AlertSeverity,\n  AlertName,\n  Description,\n  Protocol,\n  SourceDeviceAddress,\n  DestDeviceAddress,\n  RemediationSteps,\n  Tactics,\n  Entities,\n  VendorOriginalId,\n  AlertLink,\n  AlertManagementUri,\n  Techniques\n",
        "queryPeriod": "3h",
        "severity": "Low",
        "eventGroupingSettings": {
          "aggregationKind": "AlertPerResult"
        },
        "name": "High bandwidth in the network (Microsoft Defender for IoT)",
        "entityMappings": [
          {
            "fieldMappings": [
              {
                "identifier": "Address",
                "columnName": "SourceDeviceAddress"
              }
            ],
            "entityType": "IP"
          },
          {
            "fieldMappings": [
              {
                "identifier": "Address",
                "columnName": "DestDeviceAddress"
              }
            ],
            "entityType": "IP"
          }
        ],
        "triggerOperator": "gt",
        "triggerThreshold": 0,
        "queryFrequency": "3h",
        "customDetails": {
          "Protocol": "Protocol",
          "Sensor": "DeviceId",
          "AlertManagementUri": "AlertManagementUri",
          "VendorOriginalId": "VendorOriginalId"
        },
        "tactics": [
          "Discovery"
        ]
      }
    }
  ]
}
