{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/f4c71e55-6192-47ca-92e2-0856ae502a46')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f4c71e55-6192-47ca-92e2-0856ae502a46')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "name": "Unauthorized device in the network (Microsoft Defender for IoT)",
        "triggerThreshold": 0,
        "tactics": [
          "Discovery"
        ],
        "status": "Available",
        "alertDetailsOverride": {
          "alertSeverityColumnName": "AlertSeverity",
          "alertTacticsColumnName": "Tactics",
          "alertDescriptionFormat": "(MDIoT) {{Description}}",
          "alertDynamicProperties": [
            {
              "value": "ProductName",
              "alertProperty": "ProductName"
            },
            {
              "value": "RemediationSteps",
              "alertProperty": "RemediationSteps"
            },
            {
              "value": "Techniques",
              "alertProperty": "Techniques"
            },
            {
              "value": "ProductComponentName",
              "alertProperty": "ProductComponentName"
            },
            {
              "value": "AlertLink",
              "alertProperty": "AlertLink"
            }
          ],
          "alertDisplayNameFormat": "(MDIoT) {{AlertName}}"
        },
        "customDetails": {
          "VendorOriginalId": "VendorOriginalId",
          "Sensor": "DeviceId",
          "Protocol": "Protocol",
          "AlertManagementUri": "AlertManagementUri"
        },
        "description": "'This alert leverages Defender for IoT to detect a new device indicating a legitimate device recently installed on the network or an indication of malicious activity such as a cyber threat attempting to manipulate the SCADA network.'\n",
        "eventGroupingSettings": {
          "aggregationKind": "AlertPerResult"
        },
        "queryPeriod": "1h",
        "query": "SecurityAlert\n| where ProviderName == \"IoTSecurity\"\n| where AlertName in (\"Field Device Discovered Unexpectedly\", \"New Asset Detected\", \"Abnormal usage of MAC Addresses\", \"New LLDP Device Configuration\")\n| extend ExtendedProperties = parse_json(ExtendedProperties)\n| where tostring(ExtendedProperties.isNew) == \"True\"\n| extend DeviceId = tostring(ExtendedProperties.DeviceId), \n         SourceDeviceAddress = tostring(ExtendedProperties.SourceDeviceAddress), \n         DestDeviceAddress = tostring(ExtendedProperties.DestinationDeviceAddress), \n         RemediationSteps = tostring(parse_json(RemediationSteps)[0]), \n         Protocol = tostring(ExtendedProperties.Protocol), \n         AlertManagementUri = tostring(ExtendedProperties.AlertManagementUri)\n| project\n  TimeGenerated,\n  DeviceId,\n  ProductName,\n  ProductComponentName,\n  AlertSeverity,\n  AlertName,\n  Description,\n  Protocol,\n  SourceDeviceAddress,\n  DestDeviceAddress,\n  RemediationSteps,\n  Tactics,\n  Entities,\n  VendorOriginalId,\n  AlertLink,\n  AlertManagementUri,\n  Techniques\n",
        "triggerOperator": "gt",
        "severity": "Medium",
        "entityMappings": [
          {
            "entityType": "IP",
            "fieldMappings": [
              {
                "columnName": "SourceDeviceAddress",
                "identifier": "Address"
              }
            ]
          },
          {
            "entityType": "IP",
            "fieldMappings": [
              {
                "columnName": "DestDeviceAddress",
                "identifier": "Address"
              }
            ]
          }
        ],
        "queryFrequency": "1h"
      }
    }
  ]
}
