{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a22740ec-fc1e-4c91-8de6-c29c6450ad00')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/a22740ec-fc1e-4c91-8de6-c29c6450ad00')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "triggerThreshold": 0,
        "query": "let aadFunc = (tableName:string){ \ntable(tableName) \n| where ResultType == 500121 \n| where Status has \"MFA Denied; user declined the authentication\" or Status has \"MFA denied; Phone App Reported Fraud\" \n| extend Type = Type, PublicIP = IPAddress  \n| extend Name = tostring(split(UserPrincipalName,'@',0)[0]), UPNSuffix = tostring(split(UserPrincipalName,'@',1)[0]) \n}; \nlet aadSignin = aadFunc(\"SigninLogs\"); \nlet dvcInfo = DeviceInfo\n| extend SensorHealthState = column_ifexists(\"SensorHealthState\", \"\")\n| where OnboardingStatus == \"Onboarded\" and SensorHealthState == \"Active\" \n| project PublicIP, AadDeviceId; \nlet aadNonInt = aadFunc(\"AADNonInteractiveUserSignInLogs\"); \nunion isfuzzy=true aadSignin, aadNonInt  \n| join kind=leftouter dvcInfo on PublicIP  \n",
        "severity": "Medium",
        "name": "Explicit MFA Deny",
        "queryPeriod": "1d",
        "queryFrequency": "1d",
        "triggerOperator": "gt",
        "status": "Available",
        "entityMappings": [
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "columnName": "UserPrincipalName",
                "identifier": "FullName"
              },
              {
                "columnName": "Name",
                "identifier": "Name"
              },
              {
                "columnName": "UPNSuffix",
                "identifier": "UPNSuffix"
              }
            ]
          },
          {
            "entityType": "IP",
            "fieldMappings": [
              {
                "columnName": "PublicIP",
                "identifier": "Address"
              }
            ]
          },
          {
            "entityType": "AzureResource",
            "fieldMappings": [
              {
                "columnName": "ResourceID",
                "identifier": "ResourceID"
              }
            ]
          },
          {
            "entityType": "URL",
            "fieldMappings": [
              {
                "columnName": "ClientAppUsed",
                "identifier": "Url"
              }
            ]
          }
        ],
        "description": "'User explicitly denies MFA push, indicating that login was not expected and the account's password may be compromised.'\n",
        "tactics": [
          "CredentialAccess"
        ]
      }
    }
  ]
}
