{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/8138863e-e55f-4f02-ac94-72796e203d27')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8138863e-e55f-4f02-ac94-72796e203d27')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "triggerThreshold": 0,
        "name": "Defender Alert Evidence",
        "queryFrequency": "60m",
        "tactics": [
          "Persistence"
        ],
        "suppressionEnabled": false,
        "suppressionDuration": "PT5H",
        "entityMappings": [
          {
            "fieldMappings": [
              {
                "columnName": "AccountName",
                "identifier": "Name"
              }
            ],
            "entityType": "Account"
          },
          {
            "fieldMappings": [
              {
                "columnName": "LocalIP",
                "identifier": "Address"
              }
            ],
            "entityType": "IP"
          },
          {
            "fieldMappings": [
              {
                "columnName": "DeviceName",
                "identifier": "HostName"
              }
            ],
            "entityType": "Host"
          }
        ],
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "incidentConfiguration": {
          "createIncident": false,
          "groupingConfiguration": {
            "matchingMethod": "AllEntities",
            "lookbackDuration": "PT5H",
            "reopenClosedIncident": false,
            "enabled": false
          }
        },
        "queryPeriod": "60m",
        "description": "This analytic rule is looking for new alert evidence from Microsoft Defender for Endpoint. The intent is to create entries in the SecurityAlert table for every new alert evidence attached to an entity of type Device or User monitored by Defender for Endpoint.",
        "triggerOperator": "GreaterThan",
        "query": "AlertEvidence\n| where EntityType in (\"Device\", \"User\")\n",
        "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
        "severity": "High",
        "status": "Available"
      }
    }
  ]
}
