{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/7be47078-657a-43cf-9c93-b4705a9f6134')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/7be47078-657a-43cf-9c93-b4705a9f6134')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "entityMappings": [
          {
            "entityType": "URL",
            "fieldMappings": [
              {
                "identifier": "Url",
                "columnName": "Url"
              }
            ]
          },
          {
            "entityType": "DNS",
            "fieldMappings": [
              {
                "identifier": "DomainName",
                "columnName": "UrlDomain"
              }
            ]
          }
        ],
        "queryPeriod": "1h",
        "suppressionDuration": "1h",
        "incidentConfiguration": {
          "createIncident": true,
          "groupingConfiguration": {
            "enabled": true,
            "reopenClosedIncident": false,
            "lookbackDuration": "1h",
            "matchingMethod": "AllEntities"
          }
        },
        "tactics": [
          "InitialAccess"
        ],
        "triggerOperator": "gt",
        "description": "This will alert when a collision is detected for EmailUrlInfo events with VTI high severity domain IoCs",
        "severity": "High",
        "query": "EmailUrlInfo\n| join kind=inner (VisaThreatIntelligenceIOC_CL  | where IOCType == \"domain\" and SourceSeverity == \"High\")\non $left.UrlDomain == $right.Value",
        "suppressionEnabled": false,
        "triggerThreshold": 0,
        "queryFrequency": "1h",
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "name": "VTI - High Severity Domain Collision Detection"
      }
    }
  ]
}
