{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/c3e5dbaa-a540-408c-8b36-68bdfb3df088')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/c3e5dbaa-a540-408c-8b36-68bdfb3df088')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "severity": "Medium",
        "entityMappings": [
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "SubjectAccount"
              },
              {
                "identifier": "Name",
                "columnName": "SubjectUserName"
              },
              {
                "identifier": "NTDomain",
                "columnName": "SubjectDomainName"
              }
            ]
          },
          {
            "entityType": "Host",
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "Computer"
              },
              {
                "identifier": "HostName",
                "columnName": "HostName"
              },
              {
                "identifier": "DnsDomain",
                "columnName": "DnsDomain"
              }
            ]
          }
        ],
        "status": "Available",
        "name": "NRT Base64 Encoded Windows Process Command-lines",
        "description": "'This detection identifies instances of a base64 encoded PE file header seen in the process command line parameter.'\n",
        "query": "SecurityEvent\n | where EventID == 4688\n | where isnotempty(CommandLine)\n | where CommandLine contains \"TVqQAAMAAAAEAAA\"\n | extend HostName = tostring(split(Computer, '.', 0)[0]), DnsDomain = tostring(strcat_array(array_slice(split(Computer, '.'), 1, -1), '.'))\n",
        "tactics": [
          "Execution",
          "DefenseEvasion"
        ]
      }
    }
  ]
}
