{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/4d61bb9a-7f6d-45b1-ac0e-517e2a92f6fd')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/4d61bb9a-7f6d-45b1-ac0e-517e2a92f6fd')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "status": "Available",
        "queryPeriod": "5m",
        "triggerThreshold": 0,
        "query": "CommonSecurityLog\n| where ipv4_is_private(SourceIP)\n| where DestinationPort in (7, 9, 13, 21, 22, 23, 25, 26, 37, 79, 81, 88, 106, 110, 111, 119, 135, 139, 143, 144, 179, 199, 389, 427, 444, 445, 465, 513, 514, 515, 543, 544, 548, 554, 587, 631, 646, 873, 990, 993, 995, 1025, 1026, 1027, 1028, 1029, 1110, 1433, 1720, 1723, 1755, 1900, 2000, 2001, 2049, 2121, 2717, 3000, 3128, 3306, 3389, 3986, 4899, 5000, 5009, 5051, 5060, 5101, 5190, 5357, 5432, 5631, 5666, 5800, 5900, 6000, 6001, 6646, 7070, 8000, 8008, 8009, 8080, 8081, 8443, 8888, 9100, 9999, 10000, 32768, 49152, 49153, 49154, 49155, 49156, 49157)\n| summarize\n    dcount(DestinationPort),\n    make_set(DestinationPort),\n    make_set(ApplicationProtocol),\n    make_set(Activity),\n    make_set(SourcePort),\n    StartTime = min(TimeGenerated),\n    EndTime = max(TimeGenerated)\n    by SourceIP, DestinationIP, Computer, bin(TimeGenerated, 2m)\n| where dcount_DestinationPort > 90\n",
        "tactics": [
          "Reconnaissance"
        ],
        "triggerOperator": "gt",
        "description": "'Detect possible execution of Nmap top 100 option. This detection will detect scanning of 90% of Top 100 port of NMAP in less than 2 minutes. Unusual port only access through a scan are present in this list which is a good indicator of reconnaissance tactics. Whitelisting of Company scanners is required with implementation of the rule. Ref : https://nmap.org/book/performance-port-selection.html'\n",
        "name": "Palo Alto - possible nmap scan on with top 100 option",
        "entityMappings": [
          {
            "fieldMappings": [
              {
                "columnName": "DestinationIP",
                "identifier": "Address"
              }
            ],
            "entityType": "IP"
          },
          {
            "fieldMappings": [
              {
                "columnName": "Computer",
                "identifier": "FullName"
              }
            ],
            "entityType": "Host"
          },
          {
            "fieldMappings": [
              {
                "columnName": "SourceIP",
                "identifier": "Address"
              }
            ],
            "entityType": "IP"
          }
        ],
        "queryFrequency": "5m",
        "severity": "Medium"
      }
    }
  ]
}
