{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/eeb11b6b-e626-4228-b74d-3e730dca8999')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/eeb11b6b-e626-4228-b74d-3e730dca8999')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "status": "Available",
        "query": "AzureActivity\n| where OperationNameValue contains \"Microsoft.SecurityInsights/dataConnectors/\"\n| where ActivityStatusValue == \"Succeeded\"\n| project OperationNameValue, Caller, CallerIpAddress, ActivityStatusValue, ActivitySubstatusValue, ResourceGroup, Properties, ResourceId, TimeGenerated\n| sort by TimeGenerated desc\n| extend Account = Caller\n",
        "queryPeriod": "14d",
        "triggerOperator": "gt",
        "severity": "Medium",
        "triggerThreshold": 0,
        "queryFrequency": "1d",
        "description": "'This alert is designed to monitor data connector configurations. This alert is triggered when a data connector is added, updated, or deleted.'\n",
        "tactics": [
          "Discovery"
        ],
        "name": "M2131_DataConnectorAddedChangedRemoved",
        "entityMappings": [
          {
            "fieldMappings": [
              {
                "identifier": "ResourceId",
                "columnName": "ResourceId"
              }
            ],
            "entityType": "AzureResource"
          }
        ]
      }
    }
  ]
}
