{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ac9e233e-44d4-45eb-b522-6e47445f6582')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ac9e233e-44d4-45eb-b522-6e47445f6582')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "severity": "Medium",
        "name": "Potential Fodhelper UAC Bypass (ASIM Version)",
        "description": "'This detection looks for the steps required to conduct a UAC bypass using Fodhelper.exe. By default this detection looks for the setting of the required registry keys and the invoking of the process within 1 hour - this can be tweaked as required.'\n",
        "queryPeriod": "2h",
        "triggerOperator": "gt",
        "triggerThreshold": 0,
        "query": "imRegistry\n  | where EventType in (\"RegistryValueSet\", \"RegistryKeyCreated\")\n  | where RegistryKey has \"Software\\\\Classes\\\\ms-settings\\\\shell\\\\open\\\\command\"\n  | extend TimeKey = bin(TimeGenerated, 1h)\n  | join (imProcess\n  | where Process endswith \"fodhelper.exe\"\n  | where ParentProcessName endswith \"cmd.exe\" or ParentProcessName endswith \"powershell.exe\" or ParentProcessName endswith \"powershell_ise.exe\"\n  | extend TimeKey = bin(TimeGenerated, 1h)) on TimeKey, Dvc\n",
        "entityMappings": [
          {
            "fieldMappings": [
              {
                "columnName": "DvcHostname",
                "identifier": "FullName"
              }
            ],
            "entityType": "Host"
          },
          {
            "fieldMappings": [
              {
                "columnName": "DvcIpAddr",
                "identifier": "Address"
              }
            ],
            "entityType": "IP"
          },
          {
            "fieldMappings": [
              {
                "columnName": "ActorUsername",
                "identifier": "FullName"
              }
            ],
            "entityType": "Account"
          }
        ],
        "metadata": {
          "source": {
            "kind": "Community"
          },
          "author": {
            "name": "Pete Bryan"
          },
          "support": {
            "tier": "Community"
          },
          "categories": {
            "domains": [
              "Security - Others"
            ]
          }
        },
        "queryFrequency": "2h",
        "tactics": [
          "PrivilegeEscalation"
        ]
      }
    }
  ]
}
