{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/90b7ac11-dd6c-4ba1-a99b-737061873859')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/90b7ac11-dd6c-4ba1-a99b-737061873859')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "severity": "Medium",
        "triggerThreshold": 0,
        "eventGroupingSettings": {
          "aggregationKind": "AlertPerResult"
        },
        "description": "This query searches for devices with unexpectedly large number of activity match.",
        "queryFrequency": "1h",
        "queryPeriod": "1h",
        "tactics": [],
        "customDetails": {
          "Matches_Dest_IPs": "DestinationIPs",
          "Matches_ASP_URLs": "ASPMatchURLs",
          "Matches_Max_Severity": "MaxSeverity",
          "Matches_Count": "ModelMatchCount",
          "Matched_Models": "Models",
          "Device": "SourceHostName"
        },
        "status": "Available",
        "incidentConfiguration": {
          "groupingConfiguration": {
            "groupByAlertDetails": [],
            "groupByEntities": [
              "Host"
            ],
            "lookbackDuration": "3d",
            "matchingMethod": "Selected",
            "enabled": true,
            "reopenClosedIncident": true,
            "groupByCustomDetails": [
              "Device"
            ]
          },
          "createIncident": true
        },
        "alertDetailsOverride": {
          "alertTacticsColumnName": null,
          "alertDescriptionFormat": "The following Awake model(s):\n\n{{Models}}\n\nmatched {{ModelMatchCount}} activities, an unexpectedly large number. The destination IPs associated with these matches were:\n\n{{DestinationIPs}}",
          "alertSeverityColumnName": "SeverityName",
          "alertDisplayNameFormat": "Awake Security - High Model Match Counts On Device {{SourceHostName}}"
        },
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Arista Networks\" and DeviceProduct == \"Awake Security\"\n| summarize StartTime=min(TimeGenerated), EndTime=max(TimeGenerated), Models=make_set(Activity), ASPMatchURLs=make_set(DeviceCustomString2), SourceIPs=make_set(SourceIP),\n  DestinationIPs=make_set(DestinationIP), ModelMatchCount=sum(EventCount), MaxSeverity=max(toint(LogSeverity)) by SourceHostName\n| where ModelMatchCount > 1000 and MaxSeverity > 2\n| extend SeverityName=iff(MaxSeverity == 0, \"Informational\", iff(MaxSeverity < 5, \"Low\", iff(MaxSeverity < 8, \"Medium\", \"High\")))\n",
        "triggerOperator": "gt",
        "entityMappings": [
          {
            "entityType": "Host",
            "fieldMappings": [
              {
                "columnName": "SourceHostName",
                "identifier": "HostName"
              }
            ]
          },
          {
            "entityType": "IP",
            "fieldMappings": [
              {
                "columnName": "SourceIPs",
                "identifier": "Address"
              }
            ]
          }
        ],
        "name": "Awake Security - High Match Counts By Device"
      }
    }
  ]
}
