{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/d5e012c2-29ba-4a02-a813-37b928aafe2d')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/d5e012c2-29ba-4a02-a813-37b928aafe2d')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "eventGroupingSettings": {
          "aggregationKind": "AlertPerResult"
        },
        "name": "Awake Security - High Severity Matches By Device",
        "queryFrequency": "1h",
        "status": "Available",
        "entityMappings": [
          {
            "entityType": "Host",
            "fieldMappings": [
              {
                "columnName": "SourceHostName",
                "identifier": "HostName"
              }
            ]
          },
          {
            "entityType": "IP",
            "fieldMappings": [
              {
                "columnName": "SourceIPs",
                "identifier": "Address"
              }
            ]
          }
        ],
        "queryPeriod": "1h",
        "tactics": [],
        "severity": "Medium",
        "description": "This query searches for devices with high severity event(s).",
        "incidentConfiguration": {
          "groupingConfiguration": {
            "enabled": true,
            "groupByEntities": [
              "Host"
            ],
            "reopenClosedIncident": true,
            "matchingMethod": "Selected",
            "lookbackDuration": "3d",
            "groupByAlertDetails": [],
            "groupByCustomDetails": [
              "Device"
            ]
          },
          "createIncident": true
        },
        "alertDetailsOverride": {
          "alertDescriptionFormat": "Device {{SourceHostName}} matched the following high-severity Awake model(s):\n\n{{Models}}\n\nThe destination IPs associated with these matches were:\n\n{{DestinationIPs}}\n",
          "alertTacticsColumnName": null,
          "alertDisplayNameFormat": "Awake Security - High Severity Matches On Device {{SourceHostName}}",
          "alertSeverityColumnName": "MaxSeverity"
        },
        "query": "CommonSecurityLog\n| where DeviceVendor == \"Arista Networks\" and DeviceProduct == \"Awake Security\" and toint(LogSeverity) > 6\n| summarize StartTime=min(TimeGenerated), EndTime=max(TimeGenerated), Models=make_set(Activity), ASPMatchURLs=make_set(DeviceCustomString2), SourceIPs=make_set(SourceIP),\n  DestinationIPs=make_set(DestinationIP), ModelMatchCount=sum(EventCount), MaxSeverity=max(todecimal  (LogSeverity)) by SourceHostName\n",
        "customDetails": {
          "Matches_ASP_URLs": "ASPMatchURLs",
          "Matches_Max_Severity": "MaxSeverity",
          "Matched_Models": "Models",
          "Matches_Dest_IPs": "DestinationIPs",
          "Device": "SourceHostName",
          "Matches_Count": "ModelMatchCount"
        },
        "triggerThreshold": 0,
        "triggerOperator": "gt"
      }
    }
  ]
}
