{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "Parameters": {
    "Workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/dfa3ec92-bdae-410f-b675-fe1814e4d43e')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/dfa3ec92-bdae-410f-b675-fe1814e4d43e')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2021-03-01-preview",
      "properties": {
        "severity": "Medium",
        "queryFrequency": "1h",
        "incidentConfiguration": {
          "createIncident": true,
          "groupingConfiguration": {
            "matchingMethod": "Selected",
            "lookbackDuration": "3d",
            "reopenClosedIncident": true,
            "enabled": true,
            "groupByEntities": [
              "Host"
            ],
            "groupByCustomDetails": [
              "Device"
            ],
            "groupByAlertDetails": []
          }
        },
        "customDetails": {
          "Matched_Models": "Models",
          "Matches_Max_Severity": "MaxSeverity",
          "Device": "SourceHostName",
          "Matches_ASP_URLs": "ASPMatchURLs",
          "Matches_Dest_IPs": "DestinationIPs",
          "Matches_Count": "ModelMatchCount"
        },
        "entityMappings": [
          {
            "entityType": "Host",
            "fieldMappings": [
              {
                "identifier": "HostName",
                "columnName": "SourceHostName"
              }
            ]
          },
          {
            "entityType": "IP",
            "fieldMappings": [
              {
                "identifier": "Address",
                "columnName": "SourceIPs"
              }
            ]
          }
        ],
        "query": "CommonSecurityLog | where DeviceVendor == \"Arista Networks\" and DeviceProduct == \"Awake Security\"\n| summarize StartTime=min(TimeGenerated), EndTime=max(TimeGenerated), Models=make_set(Activity), ASPMatchURLs=make_set(DeviceCustomString2), SourceIPs=make_set(SourceIP),\n  DestinationIPs=make_set(DestinationIP), ModelMatchCount=sum(EventCount), MaxSeverity=max(toint(LogSeverity)) by SourceHostName\n| where array_length(DestinationIPs) > 1\n",
        "description": "This query searches for devices with multiple possibly malicious destinations.",
        "triggerThreshold": 0,
        "tactics": [],
        "status": "Available",
        "name": "Awake Security - Model With Multiple Destinations",
        "alertDetailsOverride": {
          "alertTacticsColumnName": null,
          "alertSeverityColumnName": null,
          "alertDisplayNameFormat": "Awake Security - Model Matches With Multiple Destinations On Device {{SourceHostName}}",
          "alertDescriptionFormat": "Device {{SourceHostName}} communicated with multiple possibly malicious destinations.  The destination IPs were:\n\n{{DestinationIPs}}\n\nThe associated with Awake model(s) were:\n\n{{Models}}\n"
        },
        "triggerOperator": "gt",
        "eventGroupingSettings": {
          "aggregationKind": "AlertPerResult"
        },
        "queryPeriod": "1h"
      }
    }
  ]
}
